
label unfathomable_feeling_prologue:
    $ prolog_time()

    play music music_list["a_promise_from_distant_days"] loop fadein 2

    show anim prolog_1 with fade

    "Я никогда не был сторонником пламенных речей и пафосных прологов перед началом истории."
    "Я просто скажу вам{w}, что моя жизнь ничем не отличалась от существования."
    "Это были дни на грани выживания и жизни{w}, сопровождаемые ярким светом монитора."
    "Не буду говорить{w}, что я пытался хоть как-то это исправить{w} — ситуация на тот момент меня устраивала целиком и полностью{w}, так что я наслаждался тем, что имел."

    "Редкие выходы на улицу за едой часто сопровождались окриками прохожих{w}, так как я всё время находился в своём мирке{w}, отгородившись от скудности улиц."
    "Эта зима{w}, в принципе{w}, должна была пройти абсолютно точно также{w}, однако{w}, случилось то{w}, чего я никак не ожидал. Но об этом чуть позже."

    pause(1)

    "На чём мы остановились?{w} Ах да.{w} Я не брыкался{w}, не избавлялся от уготовленной мне судьбы."
    "Я просто плыл по течению{w}, не обращая внимания на преграды."
    "Почему так случилось?{w} Честно сказать{w}, я и сам не до конца понимаю."

    show blink
    hide blink
    show unblink

    show prologue_dream with fade

    window hide
    pause(1)
    $ set_mode_nvl()

    "В детстве у меня не было проблем с учёбой, {w}учителя пророчили хорошую профессию и обеспеченную жизнь."
    "Ага, {w}как же иначе?"
    "Старшая школа оказалась сложнее. {w}Учиться приходилось всё больше, {w}а свободного времени было всё меньше."
    "Одноклассники всё время обходили стороной меня, {w}не приглашая не на какие встречи и праздники. {w}Впрочем, {w}так мне было даже лучше."
    "Я больше времени посвящал обучению {w}до одного момента."
    "Мы пересеклись, {w}когда ей нужна была помощь при переезде в соседнюю квартиру"
    "Я силой никогда не отличался, {w}но перенести телевизор или тумбочку могу."

    "\nНа этом всё и началось. {w}Или, {w}вернее сказать, {w}закончилось: всё меньше времени я уделял занятиям, {w}и всё больше тратил на общение и прогулки с ней."
    "В конце концов, моя успеваемость сильно упала{w} и родители разлучили нас. Но, {w}по своему обыкновению, это лишь раззадорило."
    "Тайные встречи, {w}запретная любовь {w}— всё это было так увлекательно {w}и сладостно, {w}что улыбка невольно появляется на лице каждый раз, {w}когда я вспоминаю об этом."
    
    "\nНо неожиданный удар в виде экзаменов прервал этот период свиданий."

    nvl hide dissolve
    pause(1)
    $ set_mode_nvl()

    "С горем пополам сдав основные предметы, я был направлен в Москву на платное. {w}Пробиться на бюджет у меня бы уже никак не получилось."
    "Я надеялся, {w}что полная изоляция от объекта моего обожания даст мне рабочую обстановку и концентрацию, {w}чтобы наверстать упущенные знания, {w}но не тут-то было."
    "В итоге, {w}еле отучившись там полгода и вылетев на первой же сессии, {w}я был обречён на такую жизнь."

    "\nКазалось бы: {w}одна ошибка, {w}всего одна любовь и слабость в череде правильных событий, {w}и жизнь пошла под откос."
    "{w}Или, {w}может, {w}оно того стоило? {w}Сомневаюсь в этом, {w}причём очень сильно."
    "Ладно, {w}вернёмся в реальность."

    hide prologue_dream
    nvl hide dissolve
    pause(1)
    $ set_mode_adv()
    window show 

    "Мои дни продолжали перетекать из одного в другой, {w}абсолютно не меняя своего содержания."
    "При таком ритме жизни несложно загнуться хотя бы от голода, {w}но обеспечить себя я мог."
    "А когда не мог {w}— помогали родители или копилка на чёрный день."

    "Мою жизнь нельзя было назвать скучной."
    "Я всё время развивался, {w}общался с другими людьми в интернете, {w}иногда вытирал пыль со своего пианино и пытался вспомнить минувшие уроки детства."
    "Однако они улетали от меня, {w}не давая ни шанса на их поимку. {w}Единственное, {w}что навсегда закрепилось в сознании {w}— пара мелодий, {w}очень красивых и, {w}главное, {w}очень дорогих мне."
    "Одну из них я услышал и влюбился в неё сразу же, {w}а другую написал для своей возлюбленной."
    "Но главное утешение {w}я находил в прогулках по городу вместе с музыкой."

    scene bg bus_stop with fade

    play music music_list["reminiscences"] loop fadein 2
    play ambience ambience_cold_wind_loop loop fadein 4

    "И вот, {w}как раз одна из таких прогулок стала решающей для меня."
    "Как обычно, {w}я брёл куда вели меня мои ноги и не выходил из прострации {w}до выкрика прохожего или сигнала автомобиля."
    "Однако, {w}в тот раз это было намного лучше, {w}так как никто не отвлекал меня. {w}Да и вообще, {w}на улице почти не было людей, {w}что казалось очень странным."

    "Я с неудовольствием достал руку из кармана пальто и нащупав телефон, {w}вытащил его и взглянул на табло."
    "~ 29 девабря 2014. 21 17. 13%%. Подключите зарядное устройство. ~"

    "~ Не верится, что в такое время только редкие прохожие встречаются мне на пути ~"
    "Я оглянулся, дабы проверить свою догадку, и понял, что нахожусь около остановки автобуса номер «410»"

    "~ Что же, в такое время они всё равно не ходят ~"
    "Заключил я, сев на лавочку. {w}Вновь упав в свой собственный мир я стал ждать сам не знаю чего."
    "Я наблюдал за падающими снежинками, {w}лениво проезжающими машинами и пешеходами, {w}пока мне это не надоело. {w}Опустив голову я уже полностью отдался размышлениям, {w}но внезапно их прервал грохот мотора."

    show blink
    hide blink
    show unblink

    play sound sfx_ikarus_arrive
    hide bg bus_stop
    show anim intro_10 with fade

    play music music_list["meet_me_there"] loop fadein 2

    "Я поднял голову и понял, {w}что передо мной самый настоящий ЛиАЗ {w}с номером «410»"
    "~ Какого чёрта? {w}Разве они ещё разъезжают в такое время? ~"
    
    scene anim intro_11 with fade

    play sound sfx_ikarus_open_doors
    
    "Да и странный его вид меня немного смутил. {w}Но все аргументы «против» были сломлены порывом ветра, {w}продувающим меня насквозь. {w}«Проеду кружок, а потом и домой пойду», {w}— с этой мыслью я сел в автобус."

    stop ambience
    show bg intro_xx with fade
    play sound sfx_bus_interior_moving
    
    "Внутри было тепло и уютно."
    "Я быстро кинул взгляд на маршрут, прикинув, сколько мне ехать, {w}уселся на одно из задних мест и уткнулся головой в стекло."
    "Немногочисленные машины привлекали мой взор. {w}Неоновые вывески, {w}включенный в окнах свет, {w}мерцающие табло магазинов."
    "Все эти огни большого города убаюкивали меня, {w}будто сговорившись с тихой, {w}ненавязчивой музыкой в плеере."

    stop sound
    show blink

    "Я невольно закрыл глаза и задремал…"

    hide anim intro_10
    hide bg intro_xx

    jump unfathomable_feeling_day_1